<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('books')->insert([
            'name' => 'Колонія. Нові темні віки. Книга 1',
            'description' => '
                Людство на Землі ще не оговталося від хвороби клодис, що призвела до найбільшої за пів століття пандемії, коли з’являється новий патоген, який інфікує винятково вагітних жінок. Група вчених-імунологів намагається з’ясувати, що він таке і чи пов’язана його поява з нейтринними спалахами, зафіксованими довкола планети. Чисельність населення марсіанських Колоній перевищує сто тисяч мешканців, і третина з них — народжені на Марсі. Вони програють суперспеціалістам із Землі боротьбу за робочі місця в наукомісткій економіці Марса і змушені гарувати, мов раби, на низькокваліфікованих ручних роботах. Що більше їх сягає повноліття, то дужче вони прагнуть змін, не усвідомлюючи, що ці зміни ставлять під загрозу саме існування Колоній.
            ',
            'author' => 'Макс Кідрук',
            'isbn' => '978-617-95267-2-5',
            'price' => 469,
            'availability' => true,
            'genre_id' => 1,
        ]);
        DB::table('books')->insert([
            'name' => 'П’ять ночей із Фредді. Книга 1: Срібні очі',
            'description' => 'Десять років тому в піцерії «Фредді Фазбера» сталася моторошна трагедія. Роботи-звірята, які мали розважати відвідувачів, натомість почали вбивати. Чарлі, дочка власника ресторану і творця аніматронних звірів, повертається в рідне місто. Разом із друзями вона навідується в піцерію, що десять років стояла покинутою. Проте тут досі господарюють аніматронні звірі, і наміри в них криваві… Підлітки навіть не здогадуються, яке жахіття на них чекає. Книжка доповнює і розширює всесвіт культової горор-гри «П’ять ночей із Фредді» (Five Nights at Freddy’s), яка має прихильників по всьому світу.',
            'author' => 'Коутон Скотт, Кіра Брід-Ріслі',
            'isbn' => '978-617-548-097-7',
            'price' => 250,
            'availability' => true,
            'genre_id' => 12,
        ]);
        DB::table('books')->insert([
            'name' => '451 по Фаренгейту',
            'description' => '«451° по Фаренгейту» — роман, принесший писателю мировую известность. 451° по Фаренгейту — температура, при которой воспламеняется и горит бумага. Философская антиутопия Рэя Брэдбери рисует беспросветную картину развития постиндустриального общества; это мир будущего, в котором все письменные издания безжалостно уничтожаются специальным отрядом пожарных, а хранение книг преследуется по закону, интерактивное телевидение успешно служит всеобщему оболваниванию, карательная психиатрия решительно разбирается с редкими инакомыслящими, а на охоту за неисправимыми диссидентами выходит электрический пес…',
            'author' => 'Рэй Брэдбери',
            'isbn' => '978-617-548-097-5',
            'price' => 150,
            'availability' => true,
            'genre_id' => 1,
        ]);
        DB::table('books')->insert([
            'name' => 'Ведьмак Последнее желание',
            'description' => 'Сапковский – писатель, обладающий талантом творить абсолютно оригинальные фэнтези, полностью свободные от влияния извне, однако связанные с классической мифологической традицией. Книги Сапковского не просто блистательны по литературности формы и глубине содержания. Они являют собою картину мира – мира «меча и магии», мира искрометного юмора, не только захватывающего внимание читателя, но трогающего его душу.',
            'author' => 'Анджей Сапковский',
            'isbn' => '978-617-555-097-5',
            'price' => 330,
            'availability' => true,
            'genre_id' => 1,
        ]);
        DB::table('books')->insert([
            'name' => 'Думай і багатій',
            'description' => 'Дізнавшись таємницю Ендрю Карнегі, одного з найбагатших людей усіх часів, Наполеон Гілл поклав собі за мету вивести доступну формулу, як досягати високих результатів в усіх сферах життя. Протягом 20 років він вивчав біографії сотень відомих людей, серед яких Генрі Форд, Томас Едісон і навіть троє президентів Америки. Гілл сформував свою філософію успіху, яку розкриває у книжці «Думай і багатій».
Як переконує автор, немає нічого неможливого. Від багатства вас відділяють лише 13 простих кроків, описаних у книжці. Ви навчитеся використовувати безмежну силу вашого мозку, боротися з власними страхами і перетворювати думки в реальність.',
            'author' => 'Гілл Наполеон',
            'isbn' => '978-617-7388-96-7',
            'price' => 253,
            'availability' => true,
            'genre_id' => 3,
        ]);
        DB::table('books')->insert([
            'name' => 'Правила інвестування Воррена Баффета. Як зберігати та примножувати капітал',
            'description' => 'Воррен Баффет — відомий та успішний інвестор, один із найбагатших людей у світі, відрізняється особистим стилем у веденні справ, уже давно його вважають гуру інвестування, по за очі називають «оракулом» і «мудрецем». В одній зі своїх перших компаній Buffett Partnership Limited, заснованій 1956 року, Баффет увів правило писати листи акціонерам, інформуючи їх про стан бізнесу й викладаючи принципи, якими керувався, ухвалюючи операційні рішення. Ці роки були найуспішнішими для компанії, показники прибутковості сягали найвищих індексів.',
            'author' => 'Джеремі Міллер',
            'isbn' => '978-617-548-102-8',
            'price' => 420,
            'availability' => true,
            'genre_id' => 13,
        ]);
    }
}
